#pragma once
#include "BaseScene.h"

class InGame 
	: public BaseScene
{
private:
	const char* cMap[10][10] =
	{
		{ "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр" },
		{ "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр" },
		{ "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр" },
		{ "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр" },
		{ "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр" },
		{ "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр" },
		{ "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр" },
		{ "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр" },
		{ "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр" },
		{ "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр", "бр" }
	};

public:
	virtual void Activate() override;
	virtual void Update() override;
	virtual void Render() override;
	virtual void Deactivate() override;
};

